test/dummy/app/controllers/articles_controller.rb

  def index
    @articles = Article.all rescue []
---
SELECT "articles".* FROM "articles"